package HomeWork1;

//приоритетность операторов 2.7 (5 + 7 > 20 ? 68 >= 68 : 22 * 2 >> 2++) / --8

public class Task09 {
    public static void main(String[] args) {
        int a;
        int b;
        int c;
        int d;
        boolean x;
        boolean y;
        int z;
        int t = 0;
        boolean s = false;

        a = 8;
        b = 2;

        //для удобства понимания и усвоения разбила решение по шагам

        x = 5 + 7 > 20;     // выражение 5+7=12 > 20 неверно; =false
        y = 68 >= 68;       // выражение 68 >= 68 верно; =true
        z = 22 * b >> b++;  // сначала 22 * b (=44), затем смешаем (=11) и увеличиваем b на единицу (=3); =11
        /* t = (x ? y : z);  выдает ошибку на у, т.к. это boolean (и как привести к int хз). Но т.к х =false, то переменная принимает значение
        второго значения; =11 */

        d = 11 / --a;       // сначала а уменьшаем на единицу (=7), потом t (=11) / a (=7); =1
        System.out.println(d);
    }
}
