package HomeWork1;

//приоритетность операторов 2.6 (5 + 7 > 20 ? 68 : 22 * 2 >> 2++) / --8

public class Task08 {
    public static void main(String[] args) {
        int a;
        int b;
        int c;
        boolean x;
        int y;
        int z;

        a = 8;
        b = 2;

        //для удобства понимания и усвоения разбила решение по шагам

        x = 5 + 7 > 20;     // выражение 5+7=12 > 20 неверно; =false
        y = 22 * b >> b++;  // сначала 22 * b (=44), затем смешаем (=11) и увеличиваем b на единицу (=3); =11
        z = (x ? 68 : y);   // выражение x = false, значит переменная принимает значение y; =11

        c = z / --a;        // сначала а уменьшаем на еденицу (=7), затем z (=11) / а (= 7); = 1
        System.out.println(c);

        //ПРОВЕРЯЕМ без разбивки на шаги
        a = 8;
        b = 2;

        c = (5 + 7 > 20 ? 68 : 22 * b >> b++) / --a;
        System.out.println(c);
    }
}
