package home_work_1;

//приоритетность операторов 2.7 (5 + 7 > 20 ? 68 >= 68 : 22 * 2 >> 2++) / --8

public class Task09 {
    public static void main(String[] args) {
        int a;
        int b;
        int c;
        int d;

        a = 8;
        b = 2;

      //  c = (5 + 7 > 20 ? 68 >= 68 : 22 * b >> b++) / --a;     /* выражение 5+7=12 > 20 неверно; =false; 68 >= 68 верно; =true;
                                                           //   22 * b (=44), смешаем (=11) и увеличиваем b на единицу (=3); =11;
                                                           //   а уменьшаем на единицу (=7), 11 / a (=7); =1 */

      //  System.out.println(c); // выдает ошибку на boolean (и как привести к int хз).
    }
}
