package home_work_1;

//1.5 Попробуйте сделать побитовую операцию с числова 42.5, опишите результат

public class Task03 {
    public static void main(String[] args) {
        float a;
        float c;

        a = 42.5F;

        /* При попытке применить любой побитовый оператор к переменной вещественного
        типа (например c = ~a;) будет ошибка, что неверный тип операнда для оператора */

        System.out.println("Error \"Нельзя применять побитовые операторы к вещественным типам данных\"");
    }
}
